---
kind: method
id: M:Autodesk.Revit.DB.ViewSet.Insert(Autodesk.Revit.DB.View)
source: html/c2dd8ec7-7d93-db56-dca9-fc23f2c6510c.htm
---
# Autodesk.Revit.DB.ViewSet.Insert Method

Insert the specified view into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	View item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.View`) - The view to be inserted into the set.

## Returns
Returns whether the view was inserted into the set.